# 13.1Python之数据分析.py


# numpy:表达N维数组的最基础库
# Python接口使用，C语言实现，计算速度优异
# Python数据分析及科学计算的基础库，支撑Pandas的那个
# 提供直接的矩阵运算、广播函数，线性代数等功能
# http://www.numpy.org


# Pandas库：
# Python数据分析高层次应用库
# 提供了简单易用的、具有较高抽象的数据结构和数据分析工具
# 理解数据类型与索引的关系，操作索引即操作数据方法的重要的第三方库的支持
# 是Python最主要的数据分析功能库，基于numpy开发
# 提供了两个数据结构
# Series = 索引 + 一维数据
# DataFrame = 行列的二维索引 + 二维数据
# http://pandas.pydata.org


# scipy库：
# 数学、科学和工程计算功能库
# 提供了一批数学算法及工程数据运算功能
# 类似matlab，可用于如傅里叶变换、信号处理等应用
# Python最主要的科学计算库
# 傅里叶变换类、信号处理类、线性代数类、图像处理类、稀疏图压缩类、稀疏图运算类、优化算法
# http://www.scipy.org