# 12.2计算机哲学note.py

# 计算机哲学

# 一、计算思维与程序设计
# 三种人类特征：
# 逻辑思维：推理和演绎，数学为代表
# 实证思维：实验和验证，物理为代表
# 计算思维：设计和构造，计算机为代表

# 计算思维：抽象问题的计算过程，利用计算机自动化求解
# 计算思维是基于计算机的思维方式
# 计算思维基于计算机强大的算力和海量的数据
# 抽象计算过程，关注设计和构造，而非因果
# 如：1+……+100 关心的是抽象累加的过程而非结果和公式之间的关系
# 计算机程序设计是计算机实现的主要手段

# 编程是将计算思维变成现实的手段
# 既需要设计和构造为特征的抽象问题的能力，
# 又需要以编程为手段的自动化执行方法


# 二、计算生态与Python语言
# 计算机1946年诞生，最初目的是取得二战的胜利，美国军方用于计算导弹弹道
# 破译通信密码等
# 1991 Linus torvals 发布了 Linus 内核

# 没有顶层设计、以功能为单位、具备三个特点
# 竞争发展
# 相互依存
# 迅速更迭


# 三、用户体验
# ① 进度展示：
# 进度条、步骤提示、循环次数进度提示
# ② 异常处理：
# 输入的合规性检查与异常处理
# 读写文件
# 运算结果
# ③ 其他类方法：
# 打印输出：特定位置，输出程序运行的过程信息
# 日志文件：对程序异常及用户进行定期记录
# 帮助信息


# 四、基本程序设计模式
# 模块化设计
# 配置化设计：脚本数据

# 产品定义 ——> 系统架构 ——> 设计与实现 ——> 用户体验
# 产品定义：对应用需求充分理解和明确定义，不仅仅是功能定义，也要考虑商业模式
# 系统架构：以系统的方式思考产品的技术实现，关注数据流、模块化、体系架构
# 设计与实现：结合架构完成关键设计及系统实现，结合可扩展性、灵活性等进行优化
# 用户体验：从用户角度思考应用效果，用户至上，体验优先，以用户为中心
